
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Представление = Данные.Наименование;
	Если ЗначениеЗаполнено(Данные.ВидНоменклатуры) Тогда
		Представление = Представление + " (" + НРег(Строка(Данные.ВидНоменклатуры)) + ")";
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ВидНоменклатуры");
	
КонецПроцедуры