#Область ОбработчикиСобытийЭлементовТаблицыФормыПереченьНоменклатуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументамиКлиентСервер.РассчитатьСумму(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументамиКлиентСервер.РассчитатьСумму(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	
	// Получить текущую строку табличной части.
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;

	// Установить цену.
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочникамиВызовСервера.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);
	// Пересчитать сумму строки.
	РаботаСДокументамиКлиентСервер.РассчитатьСумму(СтрокаТабличнойЧасти);	
	
КонецПроцедуры
#КонецОбласти